Ryan-Rogers/MMSoftware/MM_2015.X/support/dspic33e/h/p33EV128GM004.h
#define _SENT2DATL_CRC3_POSITION                 0x00000003
#define _SENT2DATL_CRC3_MASK                     0x00000008
#define _SENT2DATL_CRC3_LENGTH                   0x00000001

#define _SENT2DATL_DATA60_POSITION               0x00000004
#define _SENT2DATL_DATA60_MASK                   0x00000010
#define _SENT2DATL_DATA60_LENGTH                 0x00000001

#define _SENT2DATL_DATA61_POSITION               0x00000005
#define _SENT2DATL_DATA61_MASK                   0x00000020
#define _SENT2DATL_DATA61_LENGTH                 0x00000001

#define _SENT2DATL_DATA62_POSITION               0x00000006
#define _SENT2DATL_DATA62_MASK                   0x00000040
#define _SENT2DATL_DATA62_LENGTH                 0x00000001

#define _SENT2DATL_DATA63_POSITION               0x00000007
#define _SENT2DATL_DATA63_MASK                   0x00000080
#define _SENT2DATL_DATA63_LENGTH                 0x00000001

#define _SENT2DATL_DATA50_POSITION               0x00000008
#define _SENT2DATL_DATA50_MASK                   0x00000100
#define _SENT2DATL_DATA50_LENGTH                 0x00000001

#define _SENT2DATL_DATA51_POSITION               0x00000009
#define _SENT2DATL_DATA51_MASK                   0x00000200
#define _SENT2DATL_DATA51_LENGTH                 0x00000001

#define _SENT2DATL_DATA52_POSITION               0x0000000A
#define _SENT2DATL_DATA52_MASK                   0x00000400
#define _SENT2DATL_DATA52_LENGTH                 0x00000001

#define _SENT2DATL_DATA53_POSITION               0x0000000B
#define _SENT2DATL_DATA53_MASK                   0x00000800
#define _SENT2DATL_DATA53_LENGTH                 0x00000001

#define _SENT2DATL_DATA40_POSITION               0x0000000C
#define _SENT2DATL_DATA40_MASK                   0x00001000
#define _SENT2DATL_DATA40_LENGTH                 0x00000001

#define _SENT2DATL_DATA41_POSITION               0x0000000D
#define _SENT2DATL_DATA41_MASK                   0x00002000
#define _SENT2DATL_DATA41_LENGTH                 0x00000001

#define _SENT2DATL_DATA42_POSITION               0x0000000E
#define _SENT2DATL_DATA42_MASK                   0x00004000
#define _SENT2DATL_DATA42_LENGTH                 0x00000001

#define _SENT2DATL_DATA43_POSITION               0x0000000F
#define _SENT2DATL_DATA43_MASK                   0x00008000
#define _SENT2DATL_DATA43_LENGTH                 0x00000001

#define _SENT2DATH_DATA3_POSITION                0x00000000
#define _SENT2DATH_DATA3_MASK                    0x0000000F
#define _SENT2DATH_DATA3_LENGTH                  0x00000004

#define _SENT2DATH_DATA2_POSITION                0x00000004
#define _SENT2DATH_DATA2_MASK                    0x000000F0
#define _SENT2DATH_DATA2_LENGTH                  0x00000004

#define _SENT2DATH_DATA1_POSITION                0x00000008
#define _SENT2DATH_DATA1_MASK                    0x00000F00
#define _SENT2DATH_DATA1_LENGTH                  0x00000004

#define _SENT2DATH_STAT_POSITION                 0x0000000C
#define _SENT2DATH_STAT_MASK                     0x0000F000
#define _SENT2DATH_STAT_LENGTH                   0x00000004

#define _SENT2DATH_DATA30_POSITION               0x00000000
#define _SENT2DATH_DATA30_MASK                   0x00000001
#define _SENT2DATH_DATA30_LENGTH                 0x00000001

#define _SENT2DATH_DATA31_POSITION               0x00000001
#define _SENT2DATH_DATA31_MASK                   0x00000002
#define _SENT2DATH_DATA31_LENGTH                 0x00000001

#define _SENT2DATH_DATA32_POSITION               0x00000002
#define _SENT2DATH_DATA32_MASK                   0x00000004
#define _SENT2DATH_DATA32_LENGTH                 0x00000001

#define _SENT2DATH_DATA33_POSITION               0x00000003
#define _SENT2DATH_DATA33_MASK                   0x00000008
#define _SENT2DATH_DATA33_LENGTH                 0x00000001

#define _SENT2DATH_DATA20_POSITION               0x00000004
#define _SENT2DATH_DATA20_MASK                   0x00000010
#define _SENT2DATH_DATA20_LENGTH                 0x00000001

#define _SENT2DATH_DATA21_POSITION               0x00000005
#define _SENT2DATH_DATA21_MASK                   0x00000020
#define _SENT2DATH_DATA21_LENGTH                 0x00000001

#define _SENT2DATH_DATA22_POSITION               0x00000006
#define _SENT2DATH_DATA22_MASK                   0x00000040
#define _SENT2DATH_DATA22_LENGTH                 0x00000001

#define _SENT2DATH_DATA23_POSITION               0x00000007
#define _SENT2DATH_DATA23_MASK                   0x00000080
#define _SENT2DATH_DATA23_LENGTH                 0x00000001

#define _SENT2DATH_DATA10_POSITION               0x00000008
#define _SENT2DATH_DATA10_MASK                   0x00000100
#define _SENT2DATH_DATA10_LENGTH                 0x00000001

#define _SENT2DATH_DATA11_POSITION               0x00000009
#define _SENT2DATH_DATA11_MASK                   0x00000200
#define _SENT2DATH_DATA11_LENGTH                 0x00000001

#define _SENT2DATH_DATA12_POSITION               0x0000000A
#define _SENT2DATH_DATA12_MASK                   0x00000400
#define _SENT2DATH_DATA12_LENGTH                 0x00000001

#define _SENT2DATH_DATA13_POSITION               0x0000000B
#define _SENT2DATH_DATA13_MASK                   0x00000800
#define _SENT2DATH_DATA13_LENGTH                 0x00000001

#define _SENT2DATH_STAT0_POSITION                0x0000000C
#define _SENT2DATH_STAT0_MASK                    0x00001000
#define _SENT2DATH_STAT0_LENGTH                  0x00000001

#define _SENT2DATH_STAT1_POSITION                0x0000000D
#define _SENT2DATH_STAT1_MASK                    0x00002000
#define _SENT2DATH_STAT1_LENGTH                  0x00000001

#define _SENT2DATH_STAT2_POSITION                0x0000000E
#define _SENT2DATH_STAT2_MASK                    0x00004000
#define _SENT2DATH_STAT2_LENGTH                  0x00000001

#define _SENT2DATH_STAT3_POSITION                0x0000000F
#define _SENT2DATH_STAT3_MASK                    0x00008000
#define _SENT2DATH_STAT3_LENGTH                  0x00000001

#define _RPOR0_RP20R_POSITION                    0x00000000
#define _RPOR0_RP20R_MASK                        0x0000003F
#define _RPOR0_RP20R_LENGTH                      0x00000006

#define _RPOR0_RP35R_POSITION                    0x00000008
#define _RPOR0_RP35R_MASK                        0x00003F00
#define _RPOR0_RP35R_LENGTH                      0x00000006

#define _RPOR0_RP20R0_POSITION                   0x00000000
#define _RPOR0_RP20R0_MASK                       0x00000001
#define _RPOR0_RP20R0_LENGTH                     0x00000001

