Ryan-Rogers/MMSoftware/MM_2015.X/support/dspic33e/h/p33EV128GM004.h
#define _RPINR44_SENT1R0_POSITION                0x00000008
#define _RPINR44_SENT1R0_MASK                    0x00000100
#define _RPINR44_SENT1R0_LENGTH                  0x00000001

#define _RPINR44_SENT1R1_POSITION                0x00000009
#define _RPINR44_SENT1R1_MASK                    0x00000200
#define _RPINR44_SENT1R1_LENGTH                  0x00000001

#define _RPINR44_SENT1R2_POSITION                0x0000000A
#define _RPINR44_SENT1R2_MASK                    0x00000400
#define _RPINR44_SENT1R2_LENGTH                  0x00000001

#define _RPINR44_SENT1R3_POSITION                0x0000000B
#define _RPINR44_SENT1R3_MASK                    0x00000800
#define _RPINR44_SENT1R3_LENGTH                  0x00000001

#define _RPINR44_SENT1R4_POSITION                0x0000000C
#define _RPINR44_SENT1R4_MASK                    0x00001000
#define _RPINR44_SENT1R4_LENGTH                  0x00000001

#define _RPINR44_SENT1R5_POSITION                0x0000000D
#define _RPINR44_SENT1R5_MASK                    0x00002000
#define _RPINR44_SENT1R5_LENGTH                  0x00000001

#define _RPINR44_SENT1R6_POSITION                0x0000000E
#define _RPINR44_SENT1R6_MASK                    0x00004000
#define _RPINR44_SENT1R6_LENGTH                  0x00000001

#define _RPINR44_SENT1R7_POSITION                0x0000000F
#define _RPINR44_SENT1R7_MASK                    0x00008000
#define _RPINR44_SENT1R7_LENGTH                  0x00000001

#define _RPINR45_SENT2R_POSITION                 0x00000000
#define _RPINR45_SENT2R_MASK                     0x000000FF
#define _RPINR45_SENT2R_LENGTH                   0x00000008

#define _RPINR45_SENT2R0_POSITION                0x00000000
#define _RPINR45_SENT2R0_MASK                    0x00000001
#define _RPINR45_SENT2R0_LENGTH                  0x00000001

#define _RPINR45_SENT2R1_POSITION                0x00000001
#define _RPINR45_SENT2R1_MASK                    0x00000002
#define _RPINR45_SENT2R1_LENGTH                  0x00000001

#define _RPINR45_SENT2R2_POSITION                0x00000002
#define _RPINR45_SENT2R2_MASK                    0x00000004
#define _RPINR45_SENT2R2_LENGTH                  0x00000001

#define _RPINR45_SENT2R3_POSITION                0x00000003
#define _RPINR45_SENT2R3_MASK                    0x00000008
#define _RPINR45_SENT2R3_LENGTH                  0x00000001

#define _RPINR45_SENT2R4_POSITION                0x00000004
#define _RPINR45_SENT2R4_MASK                    0x00000010
#define _RPINR45_SENT2R4_LENGTH                  0x00000001

#define _RPINR45_SENT2R5_POSITION                0x00000005
#define _RPINR45_SENT2R5_MASK                    0x00000020
#define _RPINR45_SENT2R5_LENGTH                  0x00000001

#define _RPINR45_SENT2R6_POSITION                0x00000006
#define _RPINR45_SENT2R6_MASK                    0x00000040
#define _RPINR45_SENT2R6_LENGTH                  0x00000001

#define _RPINR45_SENT2R7_POSITION                0x00000007
#define _RPINR45_SENT2R7_MASK                    0x00000080
#define _RPINR45_SENT2R7_LENGTH                  0x00000001

#define _DMTCON_ON_POSITION                      0x0000000F
#define _DMTCON_ON_MASK                          0x00008000
#define _DMTCON_ON_LENGTH                        0x00000001

#define _DMTPRECLR_STEP1_POSITION                0x00000008
#define _DMTPRECLR_STEP1_MASK                    0x0000FF00
#define _DMTPRECLR_STEP1_LENGTH                  0x00000008

#define _DMTCLR_STEP2_POSITION                   0x00000000
#define _DMTCLR_STEP2_MASK                       0x000000FF
#define _DMTCLR_STEP2_LENGTH                     0x00000008

#define _DMTSTAT_WINOPN_POSITION                 0x00000000
#define _DMTSTAT_WINOPN_MASK                     0x00000001
#define _DMTSTAT_WINOPN_LENGTH                   0x00000001

#define _DMTSTAT_DMTEVENT_POSITION               0x00000005
#define _DMTSTAT_DMTEVENT_MASK                   0x00000020
#define _DMTSTAT_DMTEVENT_LENGTH                 0x00000001

#define _DMTSTAT_BAD2_POSITION                   0x00000006
#define _DMTSTAT_BAD2_MASK                       0x00000040
#define _DMTSTAT_BAD2_LENGTH                     0x00000001

#define _DMTSTAT_BAD1_POSITION                   0x00000007
#define _DMTSTAT_BAD1_MASK                       0x00000080
#define _DMTSTAT_BAD1_LENGTH                     0x00000001

#define _NVMCON_NVMOP_POSITION                   0x00000000
#define _NVMCON_NVMOP_MASK                       0x0000000F
#define _NVMCON_NVMOP_LENGTH                     0x00000004

#define _NVMCON_URERR_POSITION                   0x00000008
#define _NVMCON_URERR_MASK                       0x00000100
#define _NVMCON_URERR_LENGTH                     0x00000001

#define _NVMCON_RPDF_POSITION                    0x00000009
#define _NVMCON_RPDF_MASK                        0x00000200
#define _NVMCON_RPDF_LENGTH                      0x00000001

#define _NVMCON_NVMSIDL_POSITION                 0x0000000C
#define _NVMCON_NVMSIDL_MASK                     0x00001000
#define _NVMCON_NVMSIDL_LENGTH                   0x00000001

#define _NVMCON_WRERR_POSITION                   0x0000000D
#define _NVMCON_WRERR_MASK                       0x00002000
#define _NVMCON_WRERR_LENGTH                     0x00000001

#define _NVMCON_WREN_POSITION                    0x0000000E
#define _NVMCON_WREN_MASK                        0x00004000
#define _NVMCON_WREN_LENGTH                      0x00000001

#define _NVMCON_WR_POSITION                      0x0000000F
#define _NVMCON_WR_MASK                          0x00008000
#define _NVMCON_WR_LENGTH                        0x00000001

#define _NVMCON_NVMOP0_POSITION                  0x00000000
#define _NVMCON_NVMOP0_MASK                      0x00000001
#define _NVMCON_NVMOP0_LENGTH                    0x00000001

#define _NVMCON_NVMOP1_POSITION                  0x00000001
#define _NVMCON_NVMOP1_MASK                      0x00000002
#define _NVMCON_NVMOP1_LENGTH                    0x00000001

#define _NVMCON_NVMOP2_POSITION                  0x00000002
#define _NVMCON_NVMOP2_MASK                      0x00000004
#define _NVMCON_NVMOP2_LENGTH                    0x00000001

#define _NVMCON_NVMOP3_POSITION                  0x00000003
#define _NVMCON_NVMOP3_MASK                      0x00000008
#define _NVMCON_NVMOP3_LENGTH                    0x00000001

#define _NVMADRU_NVMADRU_POSITION                0x00000000
#define _NVMADRU_NVMADRU_MASK                    0x000000FF
#define _NVMADRU_NVMADRU_LENGTH                  0x00000008

